In [3]:
import numpy as np
import pandas as pd

In [4]:
df =pd.read_csv(r"C:\Users\Aiman\Downloads\raw_students.csv")

In [5]:
df

   StudentID          Name     Age  Gender  Score                Email
0          1      John doe      20    male   85.0     john@example.com
1          2   Jane Smith       19  Female   90.0  janesmith@email.com
2          3   Bob Johnson     NaN    Male   78.0       bobj@email.com
3          4   Alice Brown      21  Female    NaN      alice@email.com
4          5     Chris Lee  twenty    Male   88.0          chris@email
5          6      John Doe      20    Male   85.0     john@example.com
6          7           NaN      22  Female   92.0      sarah@email.com
7          8  Michael King      23    Male   75.0    michael@email.com

In [6]:
df.head()

   StudentID          Name     Age  Gender  Score                Email
0          1      John doe      20    male   85.0     john@example.com
1          2   Jane Smith       19  Female   90.0  janesmith@email.com
2          3   Bob Johnson     NaN    Male   78.0       bobj@email.com
3          4   Alice Brown      21  Female    NaN      alice@email.com
4          5     Chris Lee  twenty    Male   88.0          chris@email

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   StudentID  8 non-null      int64
 1   Name       7 non-null      object
 2   Age        7 non-null      object
 3   Gender     8 non-null      object
 4   Score      7 non-null      float64
 5   Email      8 non-null      object
dtypes: float64(1), int64(1), object(4)
memory usage: 516.0+ bytes

In [8]:
df["Age"]=pd.to_numeric(df["Age"],errors="coerce")

In [9]:
df.dtypes

StudentID      int64
Name          object
Age          float64
Gender        object
Score        float64
Email         object
dtype: object

In [10]:
df

   StudentID          Name   Age  Gender  Score                Email
0          1      John doe  20.0    male   85.0     john@example.com
1          2   Jane Smith   19.0  Female   90.0  janesmith@email.com
2          3   Bob Johnson   NaN    Male   78.0       bobj@email.com
3          4   Alice Brown  21.0  Female    NaN      alice@email.com
4          5     Chris Lee   NaN    Male   88.0          chris@email
5          6      John Doe  20.0    Male   85.0     john@example.com
6          7           NaN  22.0  Female   92.0      sarah@email.com
7          8  Michael King  23.0    Male   75.0    michael@email.com

In [11]:
df.isnull().sum()

StudentID    0
Name         1
Age          2
Gender       0
Score        1
Email        0
dtype: int64

In [12]:
df["Age"].fillna(df["Age"].mean(),inplace=True)

C:\Users\Aiman\AppData\Local\Temp\ipykernel_17904\2595122914.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Age"].fillna(df["Age"].mean(),inplace=True)

In [13]:
df

   StudentID          Name        Age  Gender  Score                Email
0          1      John doe  20.000000    male   85.0     john@example.com
1          2   Jane Smith   19.000000  Female   90.0  janesmith@email.com
2          3   Bob Johnson  20.833333    Male   78.0       bobj@email.com
3          4   Alice Brown  21.000000  Female    NaN      alice@email.com
4          5     Chris Lee  20.833333    Male   88.0          chris@email
5          6      John Doe  20.000000    Male   85.0     john@example.com
6          7           NaN  22.000000  Female   92.0      sarah@email.com
7          8  Michael King  23.000000    Male   75.0    michael@email.com

In [14]:
df["Score"].fillna(df["Score"].mean())

0    85.000000
1    90.000000
2    78.000000
3    84.714286
4    88.000000
5    85.000000
6    92.000000
7    75.000000
Name: Score, dtype: float64

In [15]:
df

   StudentID          Name        Age  Gender  Score                Email
0          1      John doe  20.000000    male   85.0     john@example.com
1          2   Jane Smith   19.000000  Female   90.0  janesmith@email.com
2          3   Bob Johnson  20.833333    Male   78.0       bobj@email.com
3          4   Alice Brown  21.000000  Female    NaN      alice@email.com
4          5     Chris Lee  20.833333    Male   88.0          chris@email
5          6      John Doe  20.000000    Male   85.0     john@example.com
6          7           NaN  22.000000  Female   92.0      sarah@email.com
7          8  Michael King  23.000000    Male   75.0    michael@email.com

In [16]:
df["Score"].fillna(df["Score"].mean(),inplace=True)

C:\Users\Aiman\AppData\Local\Temp\ipykernel_17904\2854278828.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Score"].fillna(df["Score"].mean(),inplace=True)

In [17]:
df

   StudentID          Name        Age  Gender      Score                Email
0          1      John doe  20.000000    male  85.000000     john@example.com
1          2   Jane Smith   19.000000  Female  90.000000  janesmith@email.com
2          3   Bob Johnson  20.833333    Male  78.000000       bobj@email.com
3          4   Alice Brown  21.000000  Female  84.714286      alice@email.com
4          5     Chris Lee  20.833333    Male  88.000000          chris@email
5          6      John Doe  20.000000    Male  85.000000     john@example.com
6          7           NaN  22.000000  Female  92.000000      sarah@email.com
7          8  Michael King  23.000000    Male  75.000000    michael@email.com

In [18]:
df["Age"]=df["Age"].astype("int")

In [19]:
df

   StudentID          Name  Age  Gender      Score                Email
0          1      John doe   20    male  85.000000     john@example.com
1          2   Jane Smith    19  Female  90.000000  janesmith@email.com
2          3   Bob Johnson   20    Male  78.000000       bobj@email.com
3          4   Alice Brown   21  Female  84.714286      alice@email.com
4          5     Chris Lee   20    Male  88.000000          chris@email
5          6      John Doe   20    Male  85.000000     john@example.com
6          7           NaN   22  Female  92.000000      sarah@email.com
7          8  Michael King   23    Male  75.000000    michael@email.com

In [20]:
df["Name"]=df["Name"].fillna("unknown")

In [21]:
df

   StudentID          Name  Age  Gender      Score                Email
0          1      John doe   20    male  85.000000     john@example.com
1          2   Jane Smith    19  Female  90.000000  janesmith@email.com
2          3   Bob Johnson   20    Male  78.000000       bobj@email.com
3          4   Alice Brown   21  Female  84.714286      alice@email.com
4          5     Chris Lee   20    Male  88.000000          chris@email
5          6      John Doe   20    Male  85.000000     john@example.com
6          7       unknown   22  Female  92.000000      sarah@email.com
7          8  Michael King   23    Male  75.000000    michael@email.com

In [22]:
df

   StudentID          Name  Age  Gender      Score                Email
0          1      John doe   20    male  85.000000     john@example.com
1          2   Jane Smith    19  Female  90.000000  janesmith@email.com
2          3   Bob Johnson   20    Male  78.000000       bobj@email.com
3          4   Alice Brown   21  Female  84.714286      alice@email.com
4          5     Chris Lee   20    Male  88.000000          chris@email
5          6      John Doe   20    Male  85.000000     john@example.com
6          7       unknown   22  Female  92.000000      sarah@email.com
7          8  Michael King   23    Male  75.000000    michael@email.com

In [23]:
df.drop_duplicates()

   StudentID          Name  Age  Gender      Score                Email
0          1      John doe   20    male  85.000000     john@example.com
1          2   Jane Smith    19  Female  90.000000  janesmith@email.com
2          3   Bob Johnson   20    Male  78.000000       bobj@email.com
3          4   Alice Brown   21  Female  84.714286      alice@email.com
4          5     Chris Lee   20    Male  88.000000          chris@email
5          6      John Doe   20    Male  85.000000     john@example.com
6          7       unknown   22  Female  92.000000      sarah@email.com
7          8  Michael King   23    Male  75.000000    michael@email.com

In [24]:
df["Name"]=df["Name"].str.strip().str.lower()

In [25]:
df

   StudentID          Name  Age  Gender      Score                Email
0          1      john doe   20    male  85.000000     john@example.com
1          2    jane smith   19  Female  90.000000  janesmith@email.com
2          3   bob johnson   20    Male  78.000000       bobj@email.com
3          4   alice brown   21  Female  84.714286      alice@email.com
4          5     chris lee   20    Male  88.000000          chris@email
5          6      john doe   20    Male  85.000000     john@example.com
6          7       unknown   22  Female  92.000000      sarah@email.com
7          8  michael king   23    Male  75.000000    michael@email.com

In [26]:
df["Gender"]=df["Gender"].str.strip().str.capitalize()

In [27]:
df

   StudentID          Name  Age  Gender      Score                Email
0          1      john doe   20    Male  85.000000     john@example.com
1          2    jane smith   19  Female  90.000000  janesmith@email.com
2          3   bob johnson   20    Male  78.000000       bobj@email.com
3          4   alice brown   21  Female  84.714286      alice@email.com
4          5     chris lee   20    Male  88.000000          chris@email
5          6      john doe   20    Male  85.000000     john@example.com
6          7       unknown   22  Female  92.000000      sarah@email.com
7          8  michael king   23    Male  75.000000    michael@email.com

In [28]:
df.drop_duplicates("Name")

   StudentID          Name  Age  Gender      Score                Email
0          1      john doe   20    Male  85.000000     john@example.com
1          2    jane smith   19  Female  90.000000  janesmith@email.com
2          3   bob johnson   20    Male  78.000000       bobj@email.com
3          4   alice brown   21  Female  84.714286      alice@email.com
4          5     chris lee   20    Male  88.000000          chris@email
6          7       unknown   22  Female  92.000000      sarah@email.com
7          8  michael king   23    Male  75.000000    michael@email.com

In [29]:
df["Email"]=df["Email"].str.contains(r".com")

In [30]:
df

   StudentID          Name  Age  Gender      Score  Email
0          1      john doe   20    Male  85.000000   True
1          2    jane smith   19  Female  90.000000   True
2          3   bob johnson   20    Male  78.000000   True
3          4   alice brown   21  Female  84.714286   True
4          5     chris lee   20    Male  88.000000  False
5          6      john doe   20    Male  85.000000   True
6          7       unknown   22  Female  92.000000   True
7          8  michael king   23    Male  75.000000   True